In [1]:
import pandas as pd

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [3]:
df=pd.read_csv('/Users/anees/Desktop/AI ML NAVTEC Course/Datasets/nba.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [5]:
df["Salary"].mean()

4842684.105381166

In [6]:
df["Salary"].std()

5229237.598910349

In [7]:
df["Salary"].median()

2839073.0

In [8]:
df["Salary"].mode()

0    947276.0
Name: Salary, dtype: float64

In [9]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [10]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Number,457.0,1.767834e+01,1.596609e+01,0.0,5.00,13.0,25.0,99.0
Age,457.0,2.693873e+01,4.404016e+00,19.0,24.00,26.0,30.0,40.0
Weight,457.0,2.215230e+02,2.636834e+01,161.0,200.00,220.0,240.0,307.0
Salary,446.0,4.842684e+06,5.229238e+06,30888.0,1044792.25,2839073.0,6500000.0,25000000.0

In [11]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [12]:
for i in df.index:
    if df.loc[i,"Age"]>35:
        df.loc[i,"Age"]=35

In [13]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Number,457.0,1.767834e+01,1.596609e+01,0.0,5.00,13.0,25.0,99.0
Age,457.0,2.682276e+01,4.139731e+00,19.0,24.00,26.0,30.0,35.0
Weight,457.0,2.215230e+02,2.636834e+01,161.0,200.00,220.0,240.0,307.0
Salary,446.0,4.842684e+06,5.229238e+06,30888.0,1044792.25,2839073.0,6500000.0,25000000.0

In [16]:
df.to_csv('/Users/anees/Desktop/myfile1.csv',index=False)

In [ ]:
df.to_excel('/Users/anees/Desktop/myfile1.xslx')

In [20]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
453    False
454    False
455    False
456    False
457    False
Length: 458, dtype: bool

In [30]:
df1=pd.read_csv('/Users/anees/Desktop/myfile1.csv')

In [31]:
df1.duplicated().any()

True

In [25]:
df.duplicated().any()

False

In [32]:
df1.drop_duplicates(inplace=True)

In [29]:
df2.duplicated().any()

False

In [33]:
df1.duplicated().any()

False